---
type: DocumentSavedAsEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# DocumentSavedAsEventArgs

`Autodesk.Revit.DB.Events.DocumentSavedAsEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | IsSavingAsCentralFile | 2021.1 | `public bool IsSavingAsCentralFile { get ; }` |
| Property | OriginalPath | 2010 | `public string OriginalPath { get ; }` |